<b>This is the start of my project for ML.</b>  JR. 29.9.19.

This is markdown.

Machine Learning Project Submission 2019¶
Foreword
The investigation and synthesis of data contained in this Jupyter Notebook is the project submission for the 4th semester 5 credit module - Machine Learning and Statistics, part of the course entitled Higher Diploma in Science - Computing(Data Analytics), submitted to Dr. Ian McLoughlin, Lecturer and Programme Director at GMIT.

Submitted by Justin Rutherford
November 2019.

Project Requirements;
Extract from the Problem Statement;
"Choose a real-world phenomenon that can be measured and for which you could collect at least one-hundred data points across at least four different variables.
1. Investigate the types of variables involved, their likely distributions, and their relationships with each other.
2. Synthesise/simulate a data set as closely matching their properties as possible.
3. Detail your research and implement the simulation in a Jupyter notebook – the data set itself can simply be displayed in an output cell within the notebook".

Work Plan
Decide on the real world phenomenon to be simulated and access a publically available dataset.
Review the dataset and extract the relevant data for further investigation.
Establish a baseline set of parameters for which we will then simulate data relecting closely the statistics of the real data.
Conduct on-line research to establish the various probability distributions used to simulate similar datasets.
Using an appropriate/equivalent Numpy Random distribution function we will then simulate datasets based on the statistics obtained.
We will then summarise and provide commentary and comparative analysis of findings from both real and simulated datasets.
Summary Results and Commentary

In [1]:

import pandas as pd
import numpy as np

In [2]:
# Read in the csv file and select the columns we are interested in;
df = pd.read_csv("Boston.csv")

In [3]:
df.head()

   The Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic
0   prices and the demand for clean air', J. Envi...
1   vol.5, 81-102, 1978.   Used in Belsley, Kuh &...
2   ...', Wiley, 1980.   N.B. Various transformat...
3                       pages 244-261 of the latter.
4                                Variables in order:

In [4]:
df.tail()

      The Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic
1026                               396.90   5.64  23.90
1027   0.10959   0.00  11.930  0  0.5730  6.7940  89...
1028                               393.45   6.48  22.00
1029   0.04741   0.00  11.930  0  0.5730  6.0300  80...
1030                               396.90   7.88  11.90

Ok, the data set complex.

In [6]:
df

      The Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic
0      prices and the demand for clean air', J. Envi...
1      vol.5, 81-102, 1978.   Used in Belsley, Kuh &...
2      ...', Wiley, 1980.   N.B. Various transformat...
3                          pages 244-261 of the latter.
4                                   Variables in order:
...                                                 ...
1026                               396.90   5.64  23.90
1027   0.10959   0.00  11.930  0  0.5730  6.7940  89...
1028                               393.45   6.48  22.00
1029   0.04741   0.00  11.930  0  0.5730  6.0300  80...
1030                               396.90   7.88  11.90

[1031 rows x 1 columns]

Ok, we see that all the data is in 1 column, therefore we conclude that the data needs to be cleaned up.

<img src = "Images/BHP_data_index.GIF">

From the excerpt of the dataset we can conclude the following:
1. The dataset has no headers.
2. The description of the dataset contains text and numerical data.
3. The numerical data is not separated by commas (as you would normally expect to find in a CSV).
4.

So we will reload the dataset taking account of the above points.

In [22]:
df = pd.read_csv("Boston.csv", header=None, skiprows = 21, delim_whitespace=True)
df.head()

          0      1      2    3      4      5     6       7    8      9     10
0    0.00632  18.00   2.31  0.0  0.538  6.575  65.2  4.0900  1.0  296.0  15.3
1  396.90000   4.98  24.00  NaN    NaN    NaN   NaN     NaN  NaN    NaN   NaN
2    0.02731   0.00   7.07  0.0  0.469  6.421  78.9  4.9671  2.0  242.0  17.8
3  396.90000   9.14  21.60  NaN    NaN    NaN   NaN     NaN  NaN    NaN   NaN
4    0.02729   0.00   7.07  0.0  0.469  7.185  61.1  4.9671  2.0  242.0  17.8

In [23]:
df.describe()

,0,1,2,3,4,5,6,7,8,9,10
count,1012.000000,1012.000000,1012.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,180.143778,12.008350,16.834792,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534
std,188.132839,17.250728,9.912616,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000
25%,0.257830,0.000000,8.375000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000
50%,24.021000,7.240000,18.100000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000
75%,391.435000,16.780000,21.890000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000
max,396.900000,100.000000,50.000000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000

Ok. We appear to have 11 columns but we know that we should have 14 columns from the description "Variables in Order".  Matching the 1st row of data with the image we see that the columns referring to "B, LSTAT, MEDV" have been incorrectly placed in columns 0,1 & 2.   We can correct for this by renaming the column headers.